Revit 2026 API

# RevitAPIEventArgsIsCancelled Method

---

Indicates whether the event is being cancelled.

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsCancelled()
```
```vb
Public Function IsCancelled As Boolean
```
```cpp
public:
bool IsCancelled()
```
```fsharp
member IsCancelled : unit -> bool
```

#### Return Value

Boolean

If the event is cancellable and an event delegate wishes to cancel the event, it may call the Cancel() method if it is available for a particular event's arguments.

#### Reference

RevitAPIEventArgs Class

Autodesk.Revit.DB.Events Namespace